{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Feature evidence report describing a readability-enhancement change affecting the WhyILoveYouModal component and related CSS.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend components, styles, and utilities for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining global OKLCH color tokens and dark mode variants.",
  "frontend/index.html": "Development-only HTML entrypoint loading /src/main.tsx and warning not to deploy it to production.",
  "frontend/public/_headers": "Static hosting header rules defining MIME types and caching policies for assets, HTML, and service worker.",
  "frontend/public/_redirects": "SPA routing and security rules blocking /src access, serving assets directly, and falling back to index.html.",
  "frontend/public/404.html": "Simple styled 404 error page with link back to home.",
  "frontend/public/sw.js": "Service worker handling precaching, navigation caching, offline app shell, and proactive bundle caching.",
  "frontend/README.production-deploy.md": "Guide explaining how to properly deploy the production Vite build and avoid serving development files.",
  "frontend/scripts/prepare-deploy-artifact.mjs": "Node script that builds the project, verifies the dist output, and prints deployment instructions.",
  "frontend/scripts/verify-production-artifact.mjs": "Node script that checks a dist folder for a valid production build by validating index.html references and ensuring all assets exist.",
  "frontend/src/App.tsx": "Main app component that manages stage transitions, reduced‑motion preference, and service worker registration for the Valentine experience.",
  "frontend/src/components/RuntimeErrorFallback.tsx": "Error boundary component that catches runtime errors, filters known benign ones, and displays a fallback UI with a refresh option.",
  "frontend/src/components/valentine/AudioToggle.tsx": "Audio toggle button that uses the audio system to play or mute audio and handle gesture-required playback.",
  "frontend/src/components/valentine/BackButton.tsx": "Simple back-navigation button for returning to the previous stage.",
  "frontend/src/components/valentine/BackgroundLayers.tsx": "Renders animated background layers, vignette, glow effects, and special visuals for certain stages like star and ending.",
  "frontend/src/components/valentine/CelebrationStage.tsx": "Celebration stage with animated confetti, heartbeat audio, and timed transitions to show a love meter and proceed forward.",
  "frontend/src/components/valentine/CursorSparkleTrail.tsx": "Canvas-based sparkle trail that follows the cursor unless reduced motion is enabled.",
  "frontend/src/components/valentine/FinalEndingStage.tsx": "Final screen displaying romantic closing text with animated styling and a promise scroll component.",
  "frontend/src/components/valentine/Heart3DScene.tsx": "Renders a 3D extruded heart using react-three-fiber with animated rotation and camera zoom. Includes lighting and configurable reduced-motion behavior.",
  "frontend/src/components/valentine/HeartIntroStage.tsx": "Controls an intro animation that zooms into the 3D heart and then fades out before triggering completion. Uses easing and opacity transitions.",
  "frontend/src/components/valentine/HeartYesTransitionStage.tsx": "Animates a deeper zoom into the 3D heart while fading in a text message, then fades out the scene before completing.",
  "frontend/src/components/valentine/LightSweepText.tsx": "Wraps text with a shimmering light sweep overlay effect using a gradient animation.",
  "frontend/src/components/valentine/LoveMeter.tsx": "Displays an animated progress bar that fills to 100% over time with styled glow effects.",
  "frontend/src/components/valentine/NoButtonEngine.tsx": "Moves a 'No' button away from the cursor by finding safe positions and shows random shayari lines while avoiding nearby elements.",
  "frontend/src/components/valentine/ParticlesLayer.tsx": "Draws animated floating heart particles on a canvas with motion and blur, disabled when reduced motion is enabled.",
  "frontend/src/components/valentine/PromiseScroll.tsx": "Provides a swipeable or button-navigated carousel showing a series of romantic promises.",
  "frontend/src/components/valentine/ProposalQuestionStage.tsx": "Renders the main proposal card with animated buttons, including a yes button, a modal trigger, and the evasive no button engine.",
  "frontend/src/components/valentine/RippleButton.tsx": "Button component that renders a temporary ripple effect on click or touch.",
  "frontend/src/components/valentine/ShootingStarStage.tsx": "Displays a message with a timed shooting star animation and calls onComplete after 4 seconds.",
  "frontend/src/components/valentine/StageTransition.tsx": "Handles fade transitions between stages by animating opacity when currentStage changes.",
  "frontend/src/components/valentine/StorySlidesStage.tsx": "Cycles through predefined romantic slides every few seconds and triggers onComplete after the last.",
  "frontend/src/components/valentine/TypingIntroStage.tsx": "Types two intro lines sequentially, shows a main message, then calls onComplete after delays.",
  "frontend/src/components/valentine/WhyILoveYouModal.tsx": "Modal that reveals love lines one by one when opened and allows closing with backdrop or button.",
  "frontend/src/components/valentine/YesCountdownStage.tsx": "Shows countdown lines in sequence and triggers onComplete shortly after the last line.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAudioSystem.ts": "Manages background music, ambient sound, and heartbeat audio with play/pause and gesture handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, stored identity loading, and context state management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning an empty query set for this frontend-only app.",
  "frontend/src/index.css": "Tailwind base config plus custom OKLCH theme variables and utility classes for glassmorphism, glow effects, and themed light/dark styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, importing global styles.",
  "frontend/src/utils/geometry.ts": "Provides rectangle geometry helpers and a function to find a non-overlapping safe position for UI elements.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radius, and enabling plugins like typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, design goals, required features, issues, and architectural notes for the Valentine proposal microsite."
}